a = input('Your age: ')
b = (a-4)*2
print(b)
'''
ex-3
a = input('name: ')
b = input('surname: ')
print(b.startswith(a))



ex-2
phone = '8 700 736 90 90'
phone = phone.replace('8 700 736 90 90','+77007369090')
print(phone)



ex-1
a = input('where are you ')
b = input('where are you from ')
c = b + a
d = len(c) * 7
e = d ** 5
print(c)
print(len(c))
print(d)
print(e)
print(str(e))
x = len(str(e))
print(e%(10**(x-1))//(10**(x-2)))

problem 7

a= '
Мы больше не летаем и это не наши сны,
Этот остров необитаем и в нем нет весны.
И мы не производим больше искры на свет,
И как бы есть, но как будто бы нас нет.
'
print(a.upper())



Problem 6
a = 'Google Collab all the time' 
print('|'.join(a))



problem 4-2
a = input("How are you?")
b = input("How old are you?")
c = input("What is your favorite film?")
print("Your answer: \n ")


Problem 5
a = 'Свобода - это фантом, там нету тепла для меня без тебя'
print(a.count(''))



Problem 4
a = 'Bekarys'
print(a.endswith('s'))





Problem 3

Создать предложение где одна его половина написана в маленьком регистре, а вторая полностью в большом.
a = 'My name is Bekarys'
b = 'I am 18'
print(a.lower())
print(b.upper())


problem 2

 a = 'паралелепипед' 
 Спросить у пользователя бувкву и поделить строку 'a' по этому бувкву. 

a = 'паралелепипед'
print(a.split('а'))


Ploblem 1

 data = 'Пережевывай непоколебимый эпатаж братьев и сестер' 
 Взять строку data и заменить все буквы Е на число 3.

data = 'Пережевывай непоколебимый эпатаж братьев и сестер'
data = data.replace('е', '3')
print(data)
'''
